src/InformationRegisters/РезультатАнализаИнформационныхБаз/РезультатАнализаИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатАнализаИнформационныхБаз</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнформационнойБазы</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеАнализа</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПроведенияАнализа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИзменятьСтатус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИнформацияСрезПоследних/ИнформацияСрезПоследних.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнформацияСрезПоследних</name>
  <attributes>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийЯзык</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийКодЛокализации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийЯзыкСистемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийРежимЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>CatalogRef.ВерсииКонфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияПлатформы</name>
    <type>
      <types>CatalogRef.ВерсииПлатформыЦентрМониторинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияОС</name>
    <type>
      <types>CatalogRef.ВерсииОС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПроцессора</name>
    <type>
      <types>CatalogRef.ТипыПроцессоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПлатформы</name>
    <type>
      <types>CatalogRef.ТипыПлатформы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЧасовойПоясСеанса</name>
    <type>
      <types>CatalogRef.ЧасовыеПояса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОперативнаяПамять</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/НастройкиАнализаСостоянияИнформационнойБазы/НастройкиАнализаСостоянияИнформационнойБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиАнализаСостоянияИнформационнойБазы</name>
  <attributes>
    <name>ИспользоватьВесовыеКоэффициенты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаАнализаДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийКоэффициентКорреляцииПрироста</name>
    <comment>Используется, если используются весовые коэффициенты</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентКорреляцииПользовательскойАктивности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаАнализаАктивности</name>
    <comment>Сколько недель брать для сравнения с проверяемой</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодАнализаАктивности</name>
    <comment>0 - Искать максимальный коэффициент корреляции, 1 - рассчитывать средний коэффициент корреляции</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальнаяПользовательскаяАктивность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Конфигурации</name>
    <attributes>
      <name>Конфигурация</name>
      <type>
        <types>CatalogRef.Конфигурации</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторДемоБазы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПриростДанных</name>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ОперацииСтатистикиКонфигурации</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйПрирост</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентКорреляции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесовойКоэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/РезультатАнализаИнформационныхБаз/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ИсходныеДанные(Команда)
	ИсходныеДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИсходныеДанныеНаСервере()
	
	Настройки = ПолучитьНастройки(Запись.ИнформационнаяБаза);
	
	СравнительныеДанные.Очистить();
	ОтклоненияПоНеделям.Очистить();
	СравнениеПоНеделям.Очистить();
	КорреляцияПоНеделям.Очистить();
	ПриростМетаданных.Очистить();

	
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
			
	Результат = Справочники.НастройкиАнализаСостоянияИнформационнойБазы.АнализАктивностиПользователей(Настройки, Запись.ИнформационнаяБаза, Запись.ДатаПроведенияАнализа);
	СравнительныеДанные.Загрузить(Результат.СравнительныеДанные);
	ОтклоненияПоНеделям.Загрузить(Результат.ОтклоненияПоНеделям);
	
	Результат = Справочники.НастройкиАнализаСостоянияИнформационнойБазы.АнализПриростДанных(Настройки, Запись.ИнформационнаяБаза, Запись.ДатаПроведенияАнализа);
	ТаблицаМетаданных.Загрузить(Результат.ТаблицаМетаданных);
	
	// Построение диаграммы СравнениеПоНеделям.
	
	СравнениеПоНеделям.Очистить();
	СравнениеПоНеделям.ТипДиаграммы = ТипДиаграммы.График;
	СравнениеПоНеделям.Обновление = Ложь;
	СравнениеПоНеделям.Анимация = АнимацияДиаграммы.НеИспользовать;
	
	// Выбор уникальных точек и их сортировка
	Список = Новый СписокЗначений;
	Для Каждого ТекСтрока Из СравнительныеДанные Цикл   				
		Если Список.НайтиПоЗначению(ТекСтрока.Период) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Список.Добавить(ТекСтрока.Период);      			
	КонецЦикла; 	
	Список.СортироватьПоЗначению();
	
	СерииДиаграммы = Новый Соответствие;
	ТочкиДиаграммы = Новый Соответствие;
	Для Каждого ЭлементСписка Из Список Цикл
		Если ТочкиДиаграммы[ЭлементСписка.Значение] = Неопределено Тогда 
			НоваяТочка = СравнениеПоНеделям.Точки.Добавить(Формат(ЭлементСписка.Значение));
			ТочкиДиаграммы.Вставить(ЭлементСписка.Значение, НоваяТочка); 
		КонецЕсли;	
	КонецЦикла; 
	
	Для Каждого Стр Из СравнительныеДанные Цикл 
		Если СерииДиаграммы[Стр.Неделя] = Неопределено Тогда 
			НоваяСерия = СравнениеПоНеделям.Серии.Добавить("Неделя "+ Формат(Стр.Неделя));
			НоваяСерия.Маркер = ТипМаркераДиаграммы.Нет;
			СерииДиаграммы.Вставить(Стр.Неделя, НоваяСерия); 
		КонецЕсли;
		СравнениеПоНеделям.УстановитьЗначение(ТочкиДиаграммы[Стр.Период], СерииДиаграммы[Стр.Неделя], Стр.Количество);
	КонецЦикла;
	
	// Построение диаграммы КорреляцияПоНеделям.
	
	СерииДиаграммыКорр = Новый Соответствие;
	ТочкиДиаграммыКорр = Новый Соответствие;
	КорреляцияПоНеделям.ТипДиаграммы = ТипДиаграммы.График;
	КорреляцияПоНеделям.Обновление = Ложь;
	КорреляцияПоНеделям.Анимация = АнимацияДиаграммы.НеИспользовать;
	Для Каждого Стр Из ОтклоненияПоНеделям Цикл 
		Если СерииДиаграммыКорр["Корр"] = Неопределено Тогда 
			НоваяСерия = КорреляцияПоНеделям.Серии.Добавить("Коэффициент корреляции");
			НоваяСерия.Маркер = ТипМаркераДиаграммы.Нет;
			СерииДиаграммыКорр.Вставить("Корр", НоваяСерия); 
		КонецЕсли;
		Если ТочкиДиаграммыКорр[Стр.Неделя] = Неопределено Тогда 
			НоваяТочка = КорреляцияПоНеделям.Точки.Добавить(Формат(Стр.Неделя));
			ТочкиДиаграммыКорр.Вставить(Стр.Неделя, НоваяТочка); 
		КонецЕсли;
		
		КорреляцияПоНеделям.УстановитьЗначение(ТочкиДиаграммыКорр[Стр.Неделя], СерииДиаграммыКорр["Корр"], Стр.КоэффициентКорреляции);
	КонецЦикла;
	
	// Построение диаграммы ПриростМетаданных.
	
	// Выбор уникальных точек и их сортировка
	Список = Новый СписокЗначений;
	Для Каждого ТекСтрока Из ТаблицаМетаданных Цикл   				
		Если Список.НайтиПоЗначению(ТекСтрока.Период) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Список.Добавить(ТекСтрока.Период);      			
	КонецЦикла; 	
	Список.СортироватьПоЗначению();
	
	СерииДиаграммы = Новый Соответствие;
	ТочкиДиаграммы = Новый Соответствие;
	Для Каждого ЭлементСписка Из Список Цикл
		Если ТочкиДиаграммы[ЭлементСписка.Значение] = Неопределено Тогда 
			НоваяТочка = ПриростМетаданных.Точки.Добавить(Формат(ЭлементСписка.Значение));
			ТочкиДиаграммы.Вставить(ЭлементСписка.Значение, НоваяТочка); 
		КонецЕсли;	
	КонецЦикла; 
	
	ПриростМетаданных.ТипДиаграммы = ТипДиаграммы.График;
	ПриростМетаданных.Обновление = Ложь;
	ПриростМетаданных.Анимация = АнимацияДиаграммы.НеИспользовать;
	Для Каждого Стр Из ТаблицаМетаданных Цикл 
		Если СерииДиаграммы[Стр.ОбъектМетаданных] = Неопределено Тогда 
			НоваяСерия = ПриростМетаданных.Серии.Добавить(Строка(Стр.ОбъектМетаданных));
			НоваяСерия.Маркер = ТипМаркераДиаграммы.Нет;
			СерииДиаграммы.Вставить(Стр.ОбъектМетаданных, НоваяСерия); 
		КонецЕсли;
			
		ПриростМетаданных.УстановитьЗначение(ТочкиДиаграммы[Стр.Период], СерииДиаграммы[Стр.ОбъектМетаданных], Стр.Значение);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройки(ИнформационнаяБаза)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НастройкиАнализаСостоянияИнформационнойБазыКонфигурации.Ссылка КАК Ссылка,
	                      |	НастройкиАнализаСостоянияИнформационнойБазыКонфигурации.Ссылка.ИспользоватьВесовыеКоэффициенты КАК ИспользоватьВесовыеКоэффициенты,
	                      |	НастройкиАнализаСостоянияИнформационнойБазыКонфигурации.Ссылка.ГлубинаАнализаДанных КАК ГлубинаАнализаДанных,
	                      |	НастройкиАнализаСостоянияИнформационнойБазыКонфигурации.Ссылка.ОбщийКоэффициентКорреляцииПрироста КАК ОбщийКоэффициентКорреляцииПрироста,
	                      |	НастройкиАнализаСостоянияИнформационнойБазыКонфигурации.Ссылка.КоэффициентКорреляцииПользовательскойАктивности КАК КоэффициентКорреляцииПользовательскойАктивности,
	                      |	НастройкиАнализаСостоянияИнформационнойБазыКонфигурации.Ссылка.ГлубинаАнализаАктивности КАК ГлубинаАнализаАктивности,
	                      |	НастройкиАнализаСостоянияИнформационнойБазыКонфигурации.Ссылка.МетодАнализаАктивности КАК МетодАнализаАктивности,
	                      |	НастройкиАнализаСостоянияИнформационнойБазыКонфигурации.Ссылка.МинимальнаяПользовательскаяАктивность КАК МинимальнаяПользовательскаяАктивность
	                      |ИЗ
	                      |	РегистрСведений.ИнформацияСрезПоследних КАК ИнформацияСрезПоследних
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиАнализаСостоянияИнформационнойБазы.Конфигурации КАК НастройкиАнализаСостоянияИнформационнойБазыКонфигурации
	                      |		ПО ИнформацияСрезПоследних.Конфигурация = НастройкиАнализаСостоянияИнформационнойБазыКонфигурации.Конфигурация
	                      |			И (ИнформацияСрезПоследних.ИнформационнаяБаза = &ИнформационнаяБаза)");
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Настройки = Новый Структура("ИспользоватьВесовыеКоэффициенты,КоэффициентКорреляцииПользовательскойАктивности,ГлубинаАнализаДанных,ОбщийКоэффициентКорреляцииПрироста,
			|ГлубинаАнализаАктивности,МетодАнализаАктивности,МинимальнаяПользовательскаяАктивность,Конфигурации,ПриростДанных");
		ЗаполнитьЗначенияСвойств(Настройки, Выборка);
		ОбъектНастройки = Выборка.Ссылка.ПолучитьОбъект();		
		Настройки.Вставить("Конфигурации", ОбъектНастройки.Конфигурации.Выгрузить());
		Настройки.Вставить("ПриростДанных", ОбъектНастройки.ПриростДанных.Выгрузить());
		
		Возврат Настройки;
	КонецЕсли;
	
	Возврат Неопределено

КонецФункции
